mhd1fFoam/mhd1fFoam/tcabr_onefluid/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet
    {
        type            patch;
        nFaces          100;
        startFace       9850;
    }
    outlet
    {
        type            patch;
        nFaces          100;
        startFace       9950;
    }
    lowerWall
    {
        type            patch;
        nFaces          50;
        startFace       10050;
    }
    upperWall
    {
        type            patch;
        nFaces          50;
        startFace       10100;
    }
    frontAndBack
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          10000;
        startFace       10150;
    }
)

// ************************************************************************* //
