mhd1fFoam/mhd1fFoam/tcabr_onefluid/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7  
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;


vertices
(
(0.425 0 0)                   // 0   //block 1 
(0.7 0 0)                     // 1
(0.7 0.48 0)                  // 2
(0.425 0.48 0)                // 3
(0.424882 0 0.009999077)      // 4
(0.6998062 0 0.01647)         // 5
(0.6998062 0.48 0.01647)      // 6
(0.424882 0.48 0.009999077)   // 7
);

blocks
(
hex (0 1 2 3 4 5 6 7) (50 100 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    outlet
    {
        type patch;
        faces
        (
	   (1 5 6 2)
        );
    }
    lowerWall
    {
        type patch;
        faces
        (
            (0 4 5 1)
        );
    }
    upperWall
    {
        type patch;
        faces
        (
            (2 6 7 3)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
	(0 3 2 1)
	(4 5 6 7)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
